In [1]:
import pandas as pd

# Example -1 Employee Tenure

In [6]:
data = {
    'employee_id': [1, 2, 3],
    'hire_data': ['2015-01-01', '2018-06-15', '2020-09-30']
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   employee_id   hire_data
0            1  2015-01-01
1            2  2018-06-15
2            3  2020-09-30

In [7]:
df['hire_data'] = pd.to_datetime(df['hire_data'])

In [8]:
current_date = pd.to_datetime('2024-08-13')

In [9]:
df['tenure_years'] = (current_date - df['hire_data']).dt.days // 365

In [10]:
df

   employee_id  hire_data  tenure_years
0            1 2015-01-01             9
1            2 2018-06-15             6
2            3 2020-09-30             3

# Example 2. Social Media Engagment

In [11]:
data ={
    'post_id':[1,2,3],
    'likes':[100,150,200],
    'comments':[10,15,20],
    'share':[5,8,10]
}

In [12]:
df = pd.DataFrame(data)

In [13]:
df['Engagment_rate'] = (df['likes']+df['comments']+df['share'])/3

In [14]:
df

   post_id  likes  comments  share  Engagment_rate
0        1    100        10      5       38.333333
1        2    150        15      8       57.666667
2        3    200        20     10       76.666667